{
    "aboutme": "Mi nombre es Gonzalo Herrero, tengo 32 años y actualmente vivo en la ciudad de Mar del Plata, Argentina. Soy autodidacta, con una gran capacidad de adaptación y creatividad en la búsqueda de soluciones. Considero que el trabajo en equipo es fundamental para lograr mejores resultados. Destaco la importancia de escribir un código limpio y el uso de patrones de diseño para mejorar y facilitar la comprensión y el mantenimiento del mismo.",
    "presentationp1": "Hola, soy Gonzalo!",
    "presentationp2": "Técnico Superior Universitario en Programación",
    "presentationp3": "UTN, Mar del Plata",
    "projects1":"Proyectos",
    "projects2":"Este proyecto está dedicado a la gestión de una tienda, implicando la entrada de datos mediante archivos binarios y JSON para el seguimiento de mercancías, clientes y sus respectivos métodos de facturación. El equipo utilizó GitHub para mejorar la colaboración y el rendimiento. El código fue desarrollado en Java con un enfoque en crear soluciones limpias y escalables. Se llevaron a cabo revisiones regulares, actualizaciones, refactoring y optimización de código para garantizar su calidad. Además, se empleó JSON para una migración eficiente de datos.",
    "projects3":"Este proyecto tiene como objetivo crear una red social específicamente para estudiantes de la UTN en Mar del Plata, Argentina, con el fin de facilitar sus primeras experiencias laborales. Utiliza el framework MVC para una gestión eficiente del controlador y la vista. El diseño se construye utilizando HTML, CSS, Bootstrap y Javascript. La persistencia de datos se logra a través de una base de datos MySQL. Se integra una API externa para recopilar datos de los estudiantes de la UTN. Además, se emplea GitHub para mejorar el trabajo en equipo y el rendimiento general del proyecto.",
    "projects4":"Este proyecto se centra en desarrollar una aplicación de gestión de tareas que permite a los usuarios hacer un seguimiento de sus notas. Utiliza operaciones CRUD y aprovecha Redux Toolkit para una gestión eficiente de tareas. La aplicación incorpora diversas bibliotecas para el diseño del programa y animaciones, mejorando su funcionalidad general y la experiencia del usuario.",
    "projects5":"Este proyecto está dedicado al muestreo de datos mediante la consumición de APIs. Utiliza Axios para la consumición de la API, permitiendo una recuperación de datos sin problemas. Los datos se muestran utilizando Bootstrap, utilizando tablas y tarjetas con paginación para una interfaz amigable para el usuario. Se utiliza React Router para una gestión eficiente de los datos a través de componentes, lo que permite una navegación fluida e interacción con los datos.",
    "projects6":"Este proyecto se centra en implementar una plataforma de comercio electrónico. Implica la utilización de Axios para la consumición de API, permitiendo una integración sin problemas de datos externos. Los datos se presentan utilizando Bootstrap y Ant Design, aprovechando tablas y tarjetas con paginación para una representación efectiva de los datos. Se utiliza React Router para una gestión eficiente de los datos a través de componentes, garantizando una navegación fluida dentro de la aplicación. Además, el proyecto incorpora las herramientas React Toolkit y useContext para una gestión efectiva de la información dentro del programa.",
    "projects7":"Este proyecto tiene como objetivo crear una página web para un servicio de lavandería. El proceso de desarrollo sigue la metodología ágil de Kanban, incluyendo reuniones con el cliente para asegurar el montaje preciso del proyecto. Se utiliza Bootstrap y Ant Design para el diseño y la maquetación de la página. Se implementa React Router Dom para una navegación eficiente dentro de la aplicación. GitHub se utiliza para un control adecuado del proyecto, facilitando el control de versiones y la colaboración. Además, se emplea CSS puro y una librería de animaciones para dar estilo y atractivo visual a la página web.",
    "projects8":"Este proyecto se enfoca en crear una página web para un servicio de carga y transporte. El sitio web se construye utilizando el framework Gatsby, asegurando un rendimiento eficiente y optimizado. Se emplea la metodología ágil de Kanban, que incluye reuniones con el cliente para garantizar el montaje preciso del proyecto y cumplir con los requisitos. Se utiliza React-bootstrap para el diseño y el estilo de la página web, proporcionando una interfaz receptiva y visualmente atractiva. GitHub se emplea para un control adecuado del proyecto, la gestión de versiones y la colaboración entre los miembros del equipo. Se utiliza CSS puro y una librería de animaciones para mejorar el estilo de la página e incorporar animaciones atractivas para una experiencia de usuario más interactiva.",
    "projects9":"Este proyecto de React cuenta con un sistema CRUD para productos, accesible exclusivamente para administradores a través de una funcionalidad de inicio de sesión segura. Se utiliza Redux Toolkit para la gestión del estado, mientras que Bootstrap y Ant Design proporcionan una interfaz de usuario pulida. React Router DOM asegura una navegación fluida en toda la aplicación, permitiendo que los administradores autorizados realicen con confianza operaciones esenciales de Crear, Leer, Actualizar y Borrar productos.",
    "projects10":"He desarrollado un proyecto personal utilizando Laravel 10, centrado en implementar un sistema CRUD para gestionar notas junto con tareas asociadas. El proyecto utilizó Laragon como entorno de desarrollo y empleó una base de datos relacional MySQL para la gestión de datos. Esta tarea demuestra mi competencia en el framework Laravel, la gestión de bases de datos y el desarrollo de aplicaciones web.",
    "projects11":"Proyecto personal",
    "education":"Educación",
    "awards":"-Premios y Certificaciones-",
    "awards1":"Certificado en Fundamentos de Scrum",
    "awards2":"Introducción a la Programación con JavaScript",
    "awards3":"Educación IT",
    "pps":"-Experiencia Profesional-",
    "pps1":"PRÁCTICA PROFESIONAL SUPERVISADA (PPS)",
    "pps2":"Realización de una Práctica Profesional Supervisada (PPS) en la empresa Infosis - Mar del Plata, con una duración de 200 horas. Durante esta práctica, fui formado en metodologías ágiles, gestión de infraestructura, automatización, bases de datos, pruebas (QA) y especialmente en el área de desarrollo, donde trabajamos con Java utilizando Maven y Vaadin. También participé en el uso de Jira para la gestión de incidentes y en el uso de Git/GitLab.",
    "footer1":"Descargar CV",
    "modal":"Contáctame",
    "modal1": "Volver",
    "form":"Nombre:",
    "form1":"Mensaje:",
    "form2":"Enviar",
    "nav":"Inicio",
    "nav1":"SobreMi",
    "nav2":"Proyectos",
    "nav3":"Educación",
    "nav4":"Certiicados",
    "nav5":"Experiencia",
    "nav6":"Contacto",
    "backTop": "Volver arriba",
    "skills": "Tecnologías con las que he trabajado"
   
    
}