{
    "aboutme": "My name is Gonzalo Herrero, I am 32 years old and I currently live in the city of Mar del Plata, Argentina. I am self-taught, with great adaptability and creativity in search for solutions. I consider teamwork vital to achieve better results. I stand out the importance of writing a clean code, the use of design patterns to improve and facilitate the understanding and maintenance of the same.",
    "presentationp1": "Hi, im Gonzalo!,",
    "presentationp2": "University Degree in Technical Programming",
    "presentationp3": "UTN, Mar del Plata",
    "projects1":"Projects",
    "projects2":"This project is dedicated to managing a store, involving data entry using binary files and JSON for tracking merchandise, customers, and their respective billing methods. The team utilized GitHub to enhance collaboration and performance. The code was developed in Java with a focus on creating clean and scalable solutions. Regular review, updates, refactoring, and code optimization were carried out to ensure its quality. Additionally, JSON was employed for efficient data migration.",
    "projects3":" This project aims to create a social network specifically for UTN students in Mar del Plata, Argentina, to facilitate their first work experiences. It utilizes the MVC framework for efficient controller-view management. The layout is constructed using HTML, CSS, Bootstrap, and Javascript. Data persistence is achieved through a MySQL database. An external API is integrated to gather UTN student data. Additionally, GitHub is employed to enhance teamwork and overall project performance.",
    "projects4":"This project focuses on developing a task management application that allows users to keep track of their notes. It utilizes CRUD operations and leverages Redux Toolkit for efficient task management. The application incorporates various libraries for program design and animations, enhancing its overall functionality and user experience.",
    "projects5":"This project is dedicated to data sampling by consuming APIs. It utilizes Axios for API consumption, allowing seamless data retrieval. The data is displayed using Bootstrap, utilizing tables and cards with pagination for a user-friendly interface. React Router is used for efficient data management through components, enabling smooth navigation and interaction with the data.",
    "projects6":"This project focuses on implementing an e-commerce platform. It involves utilizing Axios for API consumption, enabling seamless integration of external data. The data is presented using Bootstrap and Ant Design, leveraging tables and cards with pagination for effective data representation. React Router is utilized for efficient data management through components, ensuring smooth navigation within the application. Additionally, the project incorporates the React Toolkit and useContext tools for effective information management within the program.",
    "projects7":"This project aims to create a web page for a laundry service. The development process follows the agile methodology of Kanban, including client meetings to ensure the project's accurate assembly. Bootstrap and Ant Design are utilized for the page's design and layout. React Router Dom is implemented for efficient page routing within the application. GitHub is used for proper project control, facilitating version control and collaboration. Additionally, pure CSS and an animation library are employed to give style and visual appeal to the web page.",
    "projects8":"This project focuses on creating a web page for a freight service. The website is built using the Gatsby framework, ensuring efficient and optimized performance. The agile methodology of Kanban is employed, including client meetings to ensure accurate project assembly and meet requirements. React-bootstrap is utilized for designing and styling the web page, providing a responsive and visually appealing interface. GitHub is used for proper project control, version management, and collaboration among team members. Pure CSS and an animation library are employed to enhance the page's style and incorporate engaging animations for a more interactive user experience.",
    "projects9":"This React project features a CRUD system for products, accessible exclusively to administrators through secure login functionality. Redux Toolkit is employed for state management, while Bootstrap and Ant Design provide a polished user interface. React Router DOM ensures smooth navigation throughout the application, allowing authorized administrators to perform essential Create, Read, Update, and Delete operations on products with confidence.",
    "projects10":"I have developed a personal project using Laravel 10, focused on implementing a CRUD system for managing notes along with associated tasks. The project utilized Laragon as the development environment and employed a MySQL relational database for data management. This undertaking showcases my proficiency in Laravel framework, database management, and web application development.",
    "projects11":"Personal project",
    "education":"Education",
    "awards": "-Awards and Certification-",
    "awards1":"Certificate in the foundations of Scrum",
    "awards2":" Introduction to programming with javascript",
    "awards3":"Education IT",
    "pps":"-Profesional experience-",
    "pps1":" SUPERVISED PROFESSIONAL PRACTICE (SPP)",
    "pps2":"Realization of a supervised professional practice (SPP) in the company Infosis - Mar del Plata 200Hs duration. I was trained on agile methodologies, the management of the infrastructure, automation, database, testing (QA) and especially the development area where we work with Java using Maven and Vaadin. Also the work using Jira for the management of incidents and git/gitlab.",
    "footer1":"Download CV",
    "modal":"Contact me",
    "modal1": "Return",
    "form":"Name:",
    "form1":"Message:",
    "form2":"Submit",
    "nav":"Home",
    "nav1":"AboutMe",
    "nav2":"Projects",
    "nav3":"Education",
    "nav4":"Awards",
    "nav5":"Experience",
    "nav6":"Contact",
    "backTop": "Back to Top"
    

}